{
  "copyright": "Amaravati Buddhist Monastery",
  "license": "https://creativecommons.org/licenses/by-nc-nd/3.0/",
  "volume": 2,
  "part": 4,
  "id": "ccb-2.4.2",
  "type": "raw",
  "lang": "en",
  "title": "Glossary of Pāli Terms",
  "html": "<dl>\n<dt>Anattā</dt>\n<dd><p>Literally, ‘not-self,’ i.e. impersonal, without individual essence; neither a person nor belonging to a person. One of the three characteristics of conditioned phenomena.</p>\n</dd>\n<dt>Anicca</dt>\n<dd><p>Transient, impermanent, unstable, having the nature to arise and pass away. One of the three characteristics of conditioned phenomena.</p>\n</dd>\n<dt>Añjali</dt>\n<dd><p>A gesture of respect. The palms of both hands join together directly in front of the chest, with the fingers aligned and pointing upwards.</p>\n</dd>\n<dt>Arahaṃ/Arahant</dt>\n<dd><p>Literally, ‘worthy one’ — a term applied to all enlightened beings. As an epithet of the Buddha alone, ‘Lord’ is used.</p>\n</dd>\n<dt>Ariyapuggalā</dt>\n<dd><p>‘Noble Beings’ or ‘Noble Disciples’ — there are eight kinds: those who are working on or who have achieved the four different stages of realization.</p>\n</dd>\n<dt>Bhagavā</dt>\n<dd><p>Bountiful, with good fortune — when used as an epithet of the Buddha, ‘the Fortunate One,’ ‘the Blessed One.’</p>\n</dd>\n<dt>Bhikkhu</dt>\n<dd><p>A Buddhist monk who lives as an alms mendicant, abiding by 227 training precepts that define a life of renunciation and simplicity.</p>\n</dd>\n<dt>Brahmā</dt>\n<dd><p>Celestial being; a god in one of the higher spiritual realms.</p>\n</dd>\n<dt>Buddha</dt>\n<dd><p>The Understanding One, the Awakened One, who knows things as they are; a potential in every human being. The historical Buddha, Siddhattha Gotama, lived and taught in India in the 5th century B.C.E.</p>\n</dd>\n<dt>Deva</dt>\n<dd><p>A celestial being. Less refined than a brahmā; as a deva is still in a sensual realm, albeit a very refined one.</p>\n</dd>\n<dt>Dhamma</dt>\n<dd><p>(Sanskrit: Dharma) The Teaching of the Buddha as contained in the scriptures; not dogmatic in character, but more like a raft or vehicle to convey the disciple to deliverance. Also, the Truth towards which that Teaching points; that which is beyond words, concepts or intellectual understanding. When written as ‘<em>dhamma</em>’, i.e. with lower case ‘d’, this refers to an ‘item’ or ‘thing’.</p>\n</dd>\n<dt>Dukkha</dt>\n<dd><p>Literally, ‘hard to bear’ — dis-ease, restlessness of mind, anguish, conflict, unsatisfactoriness, discontent, stress, suffering. One of the three characteristics of conditioned phenomena.</p>\n</dd>\n<dt>Factors of Awakening (bojjhaṅga)</dt>\n<dd><p>1. mindfulness, 2. investigation of truth, 3. effort, 4. rapture, 5. tranquility, 6. concentration, 7. equanimity.</p>\n</dd>\n<dt>Foundations of Mindfulness (satipaṭṭhāna)</dt>\n<dd><p>Mindfulness of 1. <em>kāya</em> (body), 2. <em>vedanā</em> (feelings), 3. <em>citta</em> (mind), 4. <em>dhamma</em> (mind-objects).</p>\n</dd>\n<dt>Grounds of Birth (yoni)</dt>\n<dd><p>The four modes of generation by which beings take birth: womb-born, egg-born, moisture-born and spontaneously born.</p>\n</dd>\n<dt>Holy Life (brahmacariya)</dt>\n<dd><p>Literally: the Brahma-conduct; usually referring to the monastic life. Using this term emphasizes the vow of celibacy.</p>\n</dd>\n<dt>Jhāna</dt>\n<dd><p>Mental absorption. A state of strong concentration focused on a single physical or sensation or mental notion.</p>\n</dd>\n<dt>Kamma</dt>\n<dd><p>(Sanskrit: karma) Action, deed; actions created by habitual impulse, intention, volition.</p>\n</dd>\n<dt>Khandhā</dt>\n<dd><p>The five aggregates, physical or mental — that is: <em>rūpa, vedanā, saññā, saṅkhārā, viññāṇa.</em> Attachment to any of these as, ‘This is mine’, ‘I am this’ or, ‘This is my self’ is <em>upādāna</em> — clinging or grasping.</p>\n</dd>\n<dt>Māra</dt>\n<dd><p>Personification of evil forces. During the Buddha’s struggle for enlightenment, Māra manifested frightening and enticing forms to try to turn him back from his goal.</p>\n</dd>\n<dt>Nibbāna</dt>\n<dd><p>(Sanskrit: Nirvāṇa) Literally, ‘coolness’ — the state of liberation from all suffering and defilements, the goal of the Buddhist path.</p>\n</dd>\n<dt>Paccekabuddha</dt>\n<dd><p>Solitary Buddha — someone enlightened by their own efforts without relying on a teacher but who, unlike the Buddha, has no following of disciples.</p>\n</dd>\n<dt>Paritta</dt>\n<dd><p>Verses chanted particularly for blessing and protection.</p>\n</dd>\n<dt>Parinibbāna</dt>\n<dd><p>The Buddha’s final passing away, i.e. final entering Nibbāna.</p>\n</dd>\n<dt>Peaceful Sage (muni)</dt>\n<dd><p>An epithet of the Buddha.</p>\n</dd>\n<dt>Planes of Birth (bhūmi)</dt>\n<dd><p>The three planes where rebirth takes place: <em>kāmāvacara-bhūmi</em>: the sensuous plane; <em>rūpāvacara-bhūmi</em>: form plane; <em>arūpāvacara-bhūmi</em>: formless plane.</p>\n</dd>\n<dt>Puñña</dt>\n<dd><p>Merit, the accumulation of good fortune, blessings, or well-being resulting from the practice of Dhamma.</p>\n</dd>\n<dt>Rūpa</dt>\n<dd><p>Form or matter. The physical elements that make up the body, i.e. earth, water, fire and air (solidity, cohesion, temperature and vibration).</p>\n</dd>\n<dt>Saṅgha</dt>\n<dd><p>The community of those who practise the Buddha’s Way.</p>\n<p>More specifically, those who have formally committed themselves to the lifestyle of mendicant monks and nuns. The ‘four pairs, the eight kinds of noble beings’ are those who are on the path to or who have realized the fruition of the four stages of enlightenment: stream-entry, once-return, non-return and arahantship.</p>\n</dd>\n<dt>Saṅkhārā</dt>\n<dd><p>Formations, constructions, all conditioned things, or volitional impulses, that is all mental states apart from feeling and perception that colour one’s thoughts and make them either good, bad or neutral.</p>\n</dd>\n<dt>Saññā</dt>\n<dd><p>Perception, the mental function of recognition.</p>\n</dd>\n<dt>Tathāgata</dt>\n<dd><p>‘Thus gone’ or ‘Thus come’ — one who has gone beyond suffering and mortality; one who experiences things as they are, without delusion. The epithet that the Buddha applied to himself.</p>\n</dd>\n<dt>Threefold bliss</dt>\n<dd><p>Mundane bliss, celestial bliss and Nibbānic bliss.</p>\n</dd>\n<dt>Triple Gem</dt>\n<dd><p>Buddha, Dhamma and Saṅgha.</p>\n</dd>\n<dt>Vedanā</dt>\n<dd><p>Feeling — physical and mental feelings that may be either pleasant, unpleasant or neutral.</p>\n</dd>\n<dt>Viññāṇa</dt>\n<dd><p>Sense consciousness — the process whereby there is seeing, hearing, smelling, tasting, touching and thinking.</p>\n</dd>\n</dl>"
}
